# def - это ключевое слово, показывающее питону, что мы создаем именно функцию
# после def через пробел идет название функции в snake_case
# сразу после названия функции пишем круглые скобки
# в круглые скобки можно передавать различные параметры через запятую, которые будут использоваться внутри функции

# функция либо возвращает что-то (например, результат каких-то вычислений внутри функции), либо не возвращает
# функция возвращает что-либо через ключевое слово return
# пишем return и дальше через пробел то, что мы хотим вернуть из функции
# функция возвращает что-либо во время вызова
# чтобы вызвать функцию надо написать название_функции и круглые скобки function_name(),
# написав function_name(), мы вызовем функцию, которую создали через def function_name()


# def name_1(z, y):
#     return z + y
# def name_2(g, j):
#     return g - j
#
# print(name_1(3, 8) + name_2(10, 4))














